In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df["FlightNumber"].fillna(10055,limit=1,inplace=True)

In [5]:
df["FlightNumber"].fillna(10075,limit=1,inplace=True)

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [7]:
df["FlightNumber"]=df["FlightNumber"].astype(int)

In [8]:
df.dtypes

From_To         object
FlightNumber     int32
RecentDelays    object
Airline         object
dtype: object

In [9]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [10]:
df["From"]=df["From_To"].str.split('_').str[0]

In [11]:
df["To"]=df["From_To"].str.split('_').str[1]

In [12]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [13]:
df.drop("From_To",axis=1,inplace=True)

In [14]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      paris
1         10055            []    <Air France> (12)    MAdrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [15]:
df["To"]

0        paris
1        miLAN
2    StockhOlm
3        PaRis
4       londOn
Name: To, dtype: object

In [16]:
m=[] 
for i in df["To"]: 
    s=i.title() 
    m.append(s)

In [17]:
m

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [18]:
df["To"]=m

In [19]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    LoNDon      Paris
1         10055            []    <Air France> (12)    MAdrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    londON  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [28]:
df1=df["RecentDelays"].apply(pd.Series)  
df1=pd.DataFrame(data=df1) 
df1.columns=["delay_1","delay_2","delay_3"] 
df1

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [29]:
df=pd.concat([df,df1],axis=1)

In [31]:
df.fillna("delays")

,FlightNumber,RecentDelays,Airline,From,To,delay_1,delay_2,delay_3
0,10045,"[23, 47]",KLM(!),LoNDon,Paris,23,47,delays
1,10055,[],<Air France> (12),MAdrid,Milan,delays,delays,delays
2,10065,"[24, 43, 87]",(British Airways. ),londON,Stockholm,24,43,87
3,10075,[13],12. Air France,Budapest,Paris,13,delays,delays
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67,32,delays